{
  "sodium.option_impact.low": "ต่ำ",
  "sodium.option_impact.medium": "กลาง",
  "sodium.option_impact.high": "สูง",
  "sodium.option_impact.extreme": "สูงมาก",
  "sodium.option_impact.varies": "แตกต่างกันไป",
  "sodium.options.pages.quality": "คุณภาพ",
  "sodium.options.pages.performance": "ประสิทธิภาพ",
  "sodium.options.pages.advanced": "ขั้นสูง",
  "sodium.options.view_distance.tooltip": "ระยะการมองเห็น ยิ่งปรับต่ำก็จะมองเห็นได้น้อยลงแต่ช่วยให้้ได้อัตราเฟรมสูงขึ้น",
  "sodium.options.simulation_distance.tooltip": "ระยะการโหลดของ Tick",
  "sodium.options.brightness.tooltip": "ควบคุมความสว่าง (แกมม่า) ของเกม",
  "sodium.options.gui_scale.tooltip": "ตั้งค่าขนาดของ GUI โดยปกติแล้ว \"อัตโนมัติ\" ระบบจะใช้ตัวขนาดที่ใหญ่ที่สุดเสมอ",
  "sodium.options.fullscreen.tooltip": "หากเปิดใช้งาน เกมจะแสดงแบบเต็มหน้าจอ (หากรองรับ)",
  "sodium.options.v_sync.tooltip": "หากเปิดใช้งาน อัตราเฟรมของเกมจะซิงโครไนซ์กับอัตราการรีเฟรชของจอภาพ ทำให้โดยทั่วไปประสบการณ์ใช้งานที่ราบรื่นขึ้นโดยสูญเสียเวลาในการตอบสนองอินพุตโดยรวม การตั้งค่านี้อาจลดประสิทธิภาพการทำงานหากระบบของคุณช้าเกินไป",
  "sodium.options.fps_limit.tooltip": "จำกัดจำนวนเฟรมสูงสุดต่อวินาที ซึ่งจะช่วยลดการใช้แบตเตอรี่และโหลดระบบทั่วไปเมื่อทำงานหลายอย่างพร้อมกัน หากเปิดใช้งาน V-Sync ตัวเลือกนี้จะถูกละเว้นเว้นแต่จะต่ำกว่าอัตราการรีเฟรชของจอแสดงผล",
  "sodium.options.view_bobbing.tooltip": "หากเปิดใช้งาน มุมมองของผู้เล่นจะแกว่งไปมาเมื่อเคลื่อนที่ไปรอบๆ ผู้เล่นที่มีอาการเมารถขณะเล่นจะได้รับประโยชน์จากการปิดการใช้งานนี้",
  "sodium.options.attack_indicator.tooltip": "ควบคุมตำแหน่งที่จะแสดงตัวบ่งชี้การโจมตีบนหน้าจอ",
  "sodium.options.autosave_indicator.tooltip": "หากเปิดใช้งาน ตัวบ่งชี้จะปรากฏขึ้นเมื่อเกมกำลังบันทึกโลกลงดิสก์",
  "sodium.options.graphics_quality.tooltip": "คุณภาพกราฟิกเริ่มต้นจะควบคุมตัวเลือกดั้งเดิมบางอย่างและจำเป็นสำหรับความเข้ากันได้ของม็อด หากตัวเลือกด้านล่างเหลือ \"ค่าเริ่มต้น\" พวกเขาจะใช้การตั้งค่านี้",
  "sodium.options.clouds_quality.tooltip": "ควบคุมคุณภาพของเมฆที่แสดงบนท้องฟ้า",
  "sodium.options.weather_quality.tooltip": "ควบคุมคุณภาพของเอฟเฟกต์ฝนและหิมะ",
  "sodium.options.leaves_quality.name": "คุณภาพใบไม้",
  "sodium.options.leaves_quality.tooltip": "ควบคุมคุณภาพของใบไม้",
  "sodium.options.particle_quality.name": "คุณภาพของพาร์ติเคิล",
  "sodium.options.particle_quality.tooltip": "ควบคุมจำนวนพาร์ติเคิลสูงสุดที่สามารถปรากฏบนหน้าจอได้ตลอดเวลา",
  "sodium.options.smooth_lighting.tooltip": "ควบคุมว่าจะให้บล็อกสว่างและแรเงาอย่างราบรื่นหรือไม่ สิ่งนี้จะเพิ่มระยะเวลาในการสร้างชังค์ใหม่เล็กน้อย แต่ไม่ส่งผลต่ออัตราเฟรม",
  "sodium.options.biome_blend.value": "%s บล็อค",
  "sodium.options.biome_blend.tooltip": "ควบคุมช่วงที่ไบโอมจะถูกสุ่มตัวอย่างสำหรับการทำสีบล็อก ค่าที่สูงขึ้นจะเพิ่มระยะเวลาที่ใช้ในการสร้างส่วนต่างๆ เพื่อลดการปรับปรุงคุณภาพอย่างมาก",
  "sodium.options.entity_distance.tooltip": "ควบคุมระยะที่เอนทิตีสามารถแสดงผลจากผู้เล่นได้ ค่าที่สูงขึ้นจะเพิ่มระยะการเรนเดอร์โดยเสียอัตราเฟรม",
  "sodium.options.entity_shadows.tooltip": "หากเปิดใช้งาน เงาพื้นฐานจะแสดงผลใต้ mobs และเอนทิตีอื่นๆ",
  "sodium.options.vignette.name": "ขอบมืด",
  "sodium.options.vignette.tooltip": "หากเปิดใช้งาน เอฟเฟกต์ขอบมืดจะแสดงผลในมุมมองของผู้เล่น ซึ่งไม่น่าจะสร้างความแตกต่างให้กับอัตราเฟรมได้มากนัก",
  "sodium.options.mipmap_levels.tooltip": "ควบคุมจำนวน mipmaps ที่จะใช้สำหรับพื้นผิวของโมเดลบล็อก ค่าที่สูงกว่าช่วยให้แสดงผลบล็อกในระยะไกลได้ดีขึ้น แต่อาจส่งผลเสียต่อประสิทธิภาพการทำงานกับพื้นผิวแบบเคลื่อนไหวจำนวนมาก",
  "sodium.options.use_block_face_culling.name": "ใช้ Block Face Culling",
  "sodium.options.use_block_face_culling.tooltip": "หากเปิดใช้งาน ระบบจะส่งเฉพาะด้านของบล็อกที่หันเข้าหากล้องเพื่อแสดงผล สิ่งนี้สามารถกำจัดบล็อกใบหน้าจำนวนมากตั้งแต่เริ่มต้นในกระบวนการเรนเดอร์ ซึ่งช่วยประหยัดแบนด์วิดท์หน่วยความจำและเวลาบน GPU ชุดทรัพยากรบางชุดอาจมีปัญหากับตัวเลือกนี้ ดังนั้นให้ลองปิดการใช้งานหากคุณเห็นช่องโหว่ในบล็อก",
  "sodium.options.use_fog_occlusion.name": "ใช้ Fog Occlusion",
  "sodium.options.use_fog_occlusion.tooltip": "หากเปิดใช้งาน ชิ้นส่วนที่ถูกกำหนดให้ซ่อนโดยสมบูรณ์ด้วยเอฟเฟกต์หมอกจะไม่แสดงผล ซึ่งช่วยปรับปรุงประสิทธิภาพ การปรับปรุงสามารถทำได้อย่างน่าทึ่งมากขึ้นเมื่อผลกระทบของหมอกมีมากขึ้น (เช่น ขณะอยู่ใต้น้ำ) แต่อาจทำให้เกิดสิ่งแปลกปลอมที่ไม่พึงประสงค์ระหว่างท้องฟ้ากับหมอกในบางสถานการณ์",
  "sodium.options.use_entity_culling.name": "ใช้ Entity Culling",
  "sodium.options.use_entity_culling.tooltip": "หากเปิดใช้งาน เอนทิตีที่ระบุว่าไม่อยู่ในส่วนที่มองเห็นได้จะถูกข้ามระหว่างการแสดงผล ซึ่งจะช่วยปรับปรุงประสิทธิภาพการทำงานโดยหลีกเลี่ยงการแสดงผลเอนทิตีที่อยู่ใต้ดินหรือหลังกำแพง",
  "sodium.options.use_particle_culling.name": "ใช้พาร์ติเคิล Culling",
  "sodium.options.use_particle_culling.tooltip": "หากเปิดใช้งาน จะแสดงเฉพาะพาร์ติเคิลที่กำหนดให้มองเห็นได้เท่านั้น สิ่งนี้สามารถปรับปรุงอัตราเฟรมได้อย่างมากเมื่อมีพาร์ติเคิลจำนวนมากอยู่ใกล้ ๆ",
  "sodium.options.animate_only_visible_textures.name": "เคลื่อนไหวเฉพาะพื้นผิวที่มองเห็นได้",
  "sodium.options.animate_only_visible_textures.tooltip": "หากเปิดใช้งาน จะมีการอัปเดตเฉพาะพื้นผิวเคลื่อนไหวที่กำหนดให้มองเห็นได้ สิ่งนี้สามารถช่วยเพิ่มอัตราเฟรมได้อย่างมากในฮาร์ดแวร์บางตัว โดยเฉพาะอย่างยิ่งกับชุดทรัพยากรที่หนักกว่า หากคุณประสบปัญหากับพื้นผิวบางอย่างที่ไม่เคลื่อนไหว ให้ลองปิดการใช้งานตัวเลือกนี้",
  "sodium.options.cpu_render_ahead_limit.name": "CPU ขีด จำกัด การแสดงผลล่วงหน้า",
  "sodium.options.cpu_render_ahead_limit.tooltip": "ระบุจำนวนเฟรมสูงสุดที่ CPU สามารถรอให้ GPU ทำการเรนเดอร์ให้เสร็จ ค่าที่ต่ำหรือสูงมากอาจทำให้อัตราเฟรมไม่เสถียร",
  "sodium.options.cpu_render_ahead_limit.value": "%s เฟรม",
  "sodium.options.allow_direct_memory_access.name": "อนุญาตการเข้าถึงหน่วยความจำโดยตรง",
  "sodium.options.allow_direct_memory_access.tooltip": "หากเปิดใช้งาน เส้นทางรหัสที่สำคัญบางเส้นทางจะได้รับอนุญาตให้ใช้การเข้าถึงหน่วยความจำโดยตรงเพื่อประสิทธิภาพ ซึ่งมักจะลดโอเวอร์เฮดของ CPU อย่างมากสำหรับการเรนเดอร์กลุ่มและเอนทิตี แต่อาจทำให้การวินิจฉัยจุดบกพร่องและข้อขัดข้องบางอย่างทำได้ยากขึ้น คุณควรปิดการใช้งานเฉพาะเมื่อคุณได้รับการร้องขอหรือรู้ว่าคุณกำลังทำอะไรอยู่",
  "sodium.options.enable_memory_tracing.name": "เปิดใช้งานการติดตามหน่วยความจำ",
  "sodium.options.enable_memory_tracing.tooltip": "คุณสมบัติการดีบัก หากเปิดใช้งาน สแต็กเทรซจะถูกรวบรวมควบคู่ไปกับการจัดสรรหน่วยความจำเพื่อช่วยปรับปรุงข้อมูลการวินิจฉัยเมื่อตรวจพบการรั่วไหลของหน่วยความจำ",
  "sodium.options.performance_impact_string": "ผลกระทบต่อประสิทธิภาพ: %s",
  "sodium.options.use_persistent_mapping.name": "ใช้การทำ mapping แบบต่อเนื่อง",
  "sodium.options.use_persistent_mapping.tooltip": "หากเปิดใช้งาน หน่วยความจำจำนวนเล็กน้อยจะถูก mapping ย่างต่อเนื่องเป็นบัฟเฟอร์ชั่วคราวสำหรับการอัปโหลดกลุ่ม ซึ่งช่วยลดโอเวอร์เฮดของ CPU และความไม่เสถียรของเวลาเฟรมเมื่อโหลดหรืออัปเดตกลุ่ม\n\nต้องใช้ OpenGL 4.4 หรือ ARB_buffer_storage",
  "sodium.options.chunk_memory_allocator.name": "ตัวจัดสรรหน่วยความจำแบบชังค์",
  "sodium.options.chunk_memory_allocator.tooltip": "เลือกตัวจัดสรรหน่วยความจำที่จะใช้สำหรับการแสดงผล ชังค์\n- ASYNC: ตัวเลือกที่เร็วที่สุด ทำงานได้ดีกับไดรเวอร์กราฟิกที่ทันสมัยส่วนใหญ่\n- SWAP: ตัวเลือกสำรองสำหรับไดรเวอร์กราฟิกรุ่นเก่า อาจเพิ่มการใช้หน่วยความจำอย่างมาก",
  "sodium.options.chunk_memory_allocator.async": "Async",
  "sodium.options.chunk_memory_allocator.swap": "Swap",
  "sodium.options.chunk_update_threads.name": "เธรดชังค์อัพเดท",
  "sodium.options.chunk_update_threads.tooltip": "ระบุจำนวนเธรดที่จะใช้สำหรับการสร้างอัน การใช้เธรดมากขึ้นสามารถเพิ่มความเร็วในการโหลดเป็นกลุ่มและอัปเดตความเร็วได้ แต่อาจส่งผลเสียต่อเวลาของเฟรม",
  "sodium.options.always_defer_chunk_updates.name": "เลื่อนการอัปเดต ชังค์ เสมอ",
  "sodium.options.always_defer_chunk_updates.tooltip": "หากเปิดใช้งาน การแสดงผลจะไม่รอให้การอัปเดตแบบกลุ่มเสร็จสิ้น แม้ว่าจะมีความสำคัญก็ตาม สิ่งนี้สามารถปรับปรุงอัตราเฟรมได้อย่างมากในบางสถานการณ์ แต่อาจสร้างความล่าช้าด้านภาพอย่างมากในโลก",
  "sodium.options.buttons.undo": "ย้อนกลับ",
  "sodium.options.buttons.apply": "นำไปใช้",
  "sodium.options.buttons.donate": "แปลโดย Laika"
}